["Slugs have 4 noses.","The Pentagon has 284 restrooms.","There are coffee flavored PEZ","An octopus has three hearts.","Coca-Cola was originally green.","Earthworms have 5 hearts.","A dog by the name of Laika was launched into space aboard the Russian spacecraft Sputnik 2 in 1957","The more a person struggles to get out of quicksand the faster they will sink. Staying still, and being calm will actually make the body float in the quicksand because the body is less dense than the quicksand is.","Oak trees can live 200 or more years.","The first female guest host of Saturday Night Live was actress Candace Bergen.","Over 80 percent of the brain is water.","James Buchanan was the only unmarried president of the United States.","Traveling by air is the safest means of transportation.","Blue Jays can imitate the calls of hawks.","Kermit the Frog was named after Kermit Scott, a childhood friend of creator Jim Henson, who became a professor of philosophy at Purdue University.","Over 90 percent of diseases are caused or complicated by stress.","The concept of Boxing Day, which is on December 26th, was to give boxes of food and clothing to the poor. It is now viewed in some countries as a time to get merchandise from stores at reduced prices.","The sap of a banana plant leaves serious stains on hands and clothes that is extremely hard to remove.","In an episode of the 1962 cartoon The Jestons, Jane Jetson is talking through a video phone. The phone number of The Jetsons was VENUS-1234","The monogram \"RR\" for Rolls-Royce has never been altered, except for when Sir Henry Royce passed away in 1933. Then it was changed from red to black.","The most famous movie theatre is the \"Chinese Theatre\" located in Los Angeles, USA","In only eight minutes, the Space Shuttle can accelerate to a speed of 27,000 kilometres per hour.","A catfish has about 100,000 taste buds.","Scallops have approximately 100 eyes around the edge of its shell.","Approximately 71 percent of American chocolate eaters prefer to eat milk chocolate.","The USS Abraham Lincoln has five gymnasiums on the ship and a basketball league with 22 teams.","The patent number of the telephone is 174465.","The Arctic Tern, which is a small bird, can fly a round trip from the Arctic to the Antarctic and back. This can be as long as twenty thousand miles per year. This is the longest migration for a bird.","The fins of the Spiny Dogfish Shark are sometimes used as sandpaper for wood products.","The first jet engine was invented by Frank Whittleof of England in 1930.","Actor John Travolta was offered the role of Billy Flynn many times for the movie \"Chicago.\" Richard Gere ended up playing the role.","The biggest hamburger that was served was 8,266 pounds. It was made at the Burger Fest in Seymour, Wisconsin.","The Christmas season begins after sunset on December 24th and lasts until January 5th. This is also known as the Twelve Days of Christmas.","The word \"super\" to a beekeeper refers to the hive box where the honey is stored.","The most recycled product in the world is the automobile.","In some parts of the Atacama Desert it has never rained.","Back in 1919, the Russian transplant pioneer Serge Voronoff made headlines by grafting monkey testicles onto human males.","In France, the Big Dipper is called the \"casserole.\"","A leech can gorge itself up to a maximum of five times its body weight.","In ancient Greece, throwing an apple to a girl was a way to propose for marriage.. If the girl caught it, that would mean she accepts.","A superstition in baseball is to never lend your bat to anyone or you will be jinxed.","According to legend, tea originated in China when tea leaves accidentally blew into a pot of boiling water.","Walt Disney had originally suggested using the name Mortimer Mouse instead of Mickey Mouse.","On May 9, 1999 approximately 600,000 gallons of whiskey flowed into the Kentucky River during a fire at Wild Turkey Distillery in Lawrenceburg.","The average American kid will eat approximately 1.500 peanut butter sandwiches by high school graduation.","A common custom in Spain is to eat one grape for each of the last 12 seconds of every year for good luck.","An armadillo can walk under water.","Ellen Macarthur, yachtswoman, had a total of 891 naps in 94 days that were each 36 minutes long while on her Vendee Round the Globe yacht race.","Pound for pound, hamburgers cost more than new cars.","The Great White Shark can grow to be more than twenty feet long and can weigh approximately 4,000 pounds.","Taco Bell serves over 35 million consumers each week in the USA","Chocolate can be fatal to dogs. Chocolate contains a chemical theobromine, which is poisonous to dogs.","The fat from sheep, which is called tallow can be used to make soap and candles.","The movie \"Cleopatra\" cost $44 million to make in 1963. The same movie would now cost $300 million to make taking inflation into account.","Roses generally need around 6 hours of sunlight to grow properly.","Basketball superstar Wilt Chamberlain holds 56 NBA records.","75 percent of all raisins eaten by people in the United States are eaten at breakfast.","There are bananas called \"Red banana\" that are maroon to dark purple when ripe.","The human liver performs over 500 functions.","In an average lifetime, people spend four years traveling in cars and six months waiting for red light to turn green.","Termites do more damage in the U.S. ever year than all the fires, storms and earthquakes combined. They do an average of $750 million in damage annually.","Over 250 million Slinky toys have been sold since its debut in 1946","Maine is the toothpick capital of the world.","Most American car horns honk in the key of F","About twenty-five percent of the population sneeze when they are exposed to light.","Girls have more tastebud than boys.","A group of tigers is called a streak.","Aztec emperor Montezuma had a nephew, Cuitlahac, whose name meant \"plenty of excrement.\"","During a typical human life span, the human heart will beat approximately 2.5 billion times.","Russian I.M. Chisov survived a 21,980 plunge out of a plane with no parachute. He landed on the steep side of a snow-covered mountain with only a fractured pelvis and slight concussion.","Humans and cows have the same gestation period, which is about nine months.","Close to fifty percent of the bacteria in the mouth lives on the surface of our tongue.","In 1976, a Los Angeles secretary named Jannene Swift officially married a fifty pound rock. More than twenty people witnessed the ceremony.","The Eisenhower interstate system requires that one mile in every fivemust be straight. These straight sections are usable as airstrips intimes ofwar or other emergencies.","Next to Warsaw, Chicago has the largest Polish population in the world.","When a polar bear cub is born, it can not see or hear. It takes approximately a month for the cub to start to see and hear.","The game of squash originated in the United Kingdom. It came about after a few boys, who were waiting for their turn to play racquets, knocked a ball around in a confined area adjoining the racquets court.","In 1873, Colgate made a toothpaste that was available in a jar.","Annually 17 tons of gold is used to make wedding rings in the United States.","The first lighthouse built in the USA was in Boston, MA in 1716","Bourbon was first made by a Baptist minister from Bourbon County in Kentucky in 1789. That is where it got its name.","There are some bananas that are red instead of yellow.","In 1955, only 330 Volkswagen Beetle's were sold at a price of $1800 each in the United States.","The amount of blood a female mosquito drinks per serving is five millionths of a liter.","As a defense mechanism, the North American Opossum closes its eyes and becomes totally limp. Basically it plays dead.","Percentage of American men who say they would marry the same woman if they had it to do all over again: 80 percent.","In the Victoria era, red tulips were a declaration of love.","The average medium size piano has about 230 strings.","In China, people eat a bar of chocolate for every 1,000 chocolate bars eaten by the British.","Women take three times longer than men when using the toilet.","Approximately 1-2 calorie are burned a minute while watching T.V","The average four year-old child asks over four hundred questions a day.","The Great Wall stretches for about 4,500 miles across North China.","The word \"lethologica\" describes the state of not being able to remember the word you want.","The world's first underground was the London Underground in1863. It has 275 stations and 253 miles of track.","Kermit the frog delivered the commencement address at Southampton College located in the state of New York in 1996","Soaking beans for twelve hours in water before they are cooked can reduce flatulence caused by beans.","There are approximately 7,000 feathers on an eagle.","According to Scandinavian traditions, if a boy and girl eat from the same loaf of bread, they are bound to fall in love.","Coca-Cola was the first soft drink to be consumed in outer space.","In the United States, 80 percent of households have oatmeal in their kitchen.","The White House has a movie theater, swimming pool, bowling lane, jogging track, and a tennis court.","Researches have discovered that eating five or more apples a week is linked to better functioning of the lungs.","The food that people crave the most is cheese.","A turtle can breathe through its butt.","Twit is the name given for a pregnant goldfish.","In Czechoslovakia, there is a church that has a chandelier made out of human bones.","One acre of wheat can produce enough bread to feed a family of four people for about ten years.","An adult esophagus can range from 10 to 14 inches in length and is one inch in diameter.","The longest one-syllable word in the English language is \"screeched.\"","Every day more money is printed for Monopoly than the US Treasury.","Adult earwigs can float in water for up to 24 hours.","Armadillos breed in July, but get pregnant in November after delaying implantation. This allows the young to be born during the spring when there is an abundance of food.","The longest chapter in the Bible is Psalm 119, which is 176 verses.","In China, pancakes are generally served as side dishes. They are stuffed with meat, bean sprouts, and other vegetables.","On average, there is about three molecules of ozone for every 10 million air molecules.","There are 315 species of parrot in the world.","At the equator the Earth spins at about 1,038 miles per hour.","The only married couple to fly together in space were Jan Davis and Mark Lee, who flew aboard the Endeavor space shuttle from Sept 12-20, 1992","There have been 191 coops in Bolivia since it became a sovereign country in 1825","85 percent of weddings are held in a synagogue or church.","There was a post office on the Russian space station Mir. Visiting cosmonauts would use unique postal \"markers\" to stamp envelopes and other items as having flown aboard the Mir space station.","To manufacture a new car approximately 148,000 liters of water is needed.","Approximately one out of every 55 women from Canada give birth in their car on the way to the hospital or clinic.","A galactic year is 250 million Earth-years. This is the time it takes for our solar system to make one revolution around the Milky Way Galaxy.","In-vitro babies are born in Australia more than any other country in the world.","High Priests in ancient Egypt were the only ones who were allowed to wear garments made from cotton.","Medical reports show that about 18 percent of the population are prone to sleepwalking.","It takes about three hours for food to be broken down in the human stomach.","The name of the famous snack \"Twinkies\" was invented by seeing a billboard in St. Louis, that said \"Twinkle Toe Shoes.\"","Spiders have claws at the ends of their legs.","Lack of sleep can affect your immune system and reduce your ability to fight infections.","The Sears Tower in Chicago contains enough steel to build 50,000 automobiles.","Approximately 125 people die in the United States from an anaphylaxis to foods each year.","Strawberries are a member of the rose family.","If you fart consistently for 6 years and 9 months, enough gas is produced to create the energy of an atomic bomb.","Alexander Graham Bell, the inventor of the telephone, never telephoned his wife or mother because they were both deaf.","The Pentagon, in Arlington, Virginia, has twice as many bathrooms as is necessary. When it was built in the 1940s, the state of Virginia still had segregation laws requiring separate toilet facilities for blacks and whites.","Hummingbirds are the only animal that can fly backwards.","In 1923, the first neon sign was introduced in the U.S. Two neon signs were sold to a Packard car dealership for $24,000 which read, \"Packard.\"","The highest consumption of Pizza occurs during Super Bowl week.","A newborn kangaroo weighs approximately 0.03 ounces and is small enough to fit in a teaspoon.","In 1477, the first diamond engagement ring was given to Mary of Burgundy by Archduke Maximillian of Austria.","In New Mexico, over eleven thousand people have visited a tortilla chip that appeared to have the face of Jesus Christ burned into it.","The word \"vamp\" is used to describe the upper front top of a shoe.","Some Chinese chopsticks contain gold as on of their materials.","The most common seasonings found in American homes are chili powder, cinnamon, and seasoned salts.","During the Easter season, 600 million Marshmallow Peeps are bought my Americans. The Marshmallow Peep is the most popular Easter candy besides chocolate.","A world record 328 pound ovarian cyst was removed from a woman in Galveston, Texas, in 1905.","Detroit, Michigan has more registered bowlers than any other city in the USA","Five percent of the people who use personal ads for dating are already married.","On average, a car driver will swear or blashpheme 32,025 times in their lifetime while driving.","A ripe cranberry will bounce. Another name for a cranberry is bounceberry.","The titan arum flower is the largest flower in the world and gives off a horrible odor that smells like rotting flesh when it blooms.","The Olympics were originally held for the Greek god Zeus.","Because metal was scarce; the Oscars given out during World War II were made of plaster.","In the summer of 1858, the smell of the sewage in the Thames River in London was so bad that the Members of Parliament had to leave from the chamber of the House of Commons. This was a result of two million people dumping all their sewage into the river.","Navel oranges got their name because the bottom of this type of orange resembles a belly button or navel.","The Hundred Years War lasted for 116 years.","The Snickers chocolate bar was invented in 1930","Carbon monoxide can kill a person in less than 15 minutes.","Dolphins can swim and sleep at the same time.","Food can only be tasted if it is mixed with saliva.","Montreal is actually located on an island.","The first human heart transplant happened on December 3, 1967. Unfortunately the patient only lived for eighteen days, succumbing in the end to pneumonia.","The name for the sign \"&\" which represents the world \"and\" is ampersand.","A dime has 118 ridges around the edge.","A dentist from Buffalo New York named Alfred P. Southwick invented the electric chair.","There is a muppet named Kami that appears on the South African version of the T.V. show \"Sesame Street\" that is HIV-positive.","The study of twins is known as gemellology.","People from North America prefer pickles with warts, where as Europeans prefer pickles with no warts.","Snails eat with a rasping mouth called a \"radula,\" which has thousands of teeth.","A colony of bees have to fly almost fifty-five thousand miles and tap two million flowers to make one pound of honey.","The name of the first menthol cigarette in the United States was \"Spud.\"","In 1994, 7-Eleven coined the term \"brain freeze.\" The word was developed to explain the feeling people get when drinking a Slurpee.","It is possible to get high by licking a toad. The Cane Toad produces a toxin called bufotenine to ward off predators. When licked, this toxin acts as a hallucinogen.","Polar bears have been known to swim more than 60 miles without resting.","There is a \"cemetery town\" in California named Colma. Concerns about the public health, crime, and the need for space forced the city of San Francisco to outlaw burials in 1902. The city of Colma, which is five miles south of San Francisco, was established to bury the dead. The ratio of dead to living people is 750 to 1","The amount of aluminum that Americans throw out in three months is enough to rebuild all American commercial planes.","The brain of an ant has about 250,000 brain cells.","Octopus and squid are thought to be the most intelligent of all invertebrates.","In a day 34,000 children die every day from causes that are related to poverty and hunger.","During the Gold Rush in 1849, some people paid as much as $100 for a simple glass of water.","Sheep can survive for up to two weeks buried in snow drifts.Click Here For More Details.","The sea cucumber spills its internal organs out as a defense mechanism.","Egyptian pyramid builders used to eat a lot of garlic because they thought it would increase their strength.","The DNA of humans is closer to a rat than a cat.","The human heart beast roughly 35 million times a year.","The only animals that are capable of turning their heads 180 degrees are from the genus Galago, such as the Tarsier.","The reason why tattoos do not vanish even though we shed our skin is because the dye is injected deeper into the dermis part of the skin. It is only the epidermis that we shed.","The first cheerleaders in the U.S. were men.","Robert Southey wrote the story \"Goldilocks and the Three Bears\" in 1834","Passion fruits have a tranquilizing effect on the body.","In 1971, the postal code was introduced in Ottawa, Ontario.","A rainbow can occur only when the sun is 40 degrees or less above the horizon.","Back in 1953, it took 27 hours to make one Marshmallow Peep. Now it takes only six minutes.","The small intestine in the human body is about 2 inches around, and 22 feet long.","There were 43,687 toilet related accidents in the United States in 1996","The movie that grossed the most money that was adapted from a T.V. cartoon is Scooby-Doo.","About 30 percent of Canadians rely on getting their water from the ground for their domestic use.","The glue on Israeli postage stamps is certified kosher.","Over 170,000 Indians from 210 tribes live in the Brazilian Amazon Rainforest.","The average person can live about a month without eating any food, but can only live about a week without water.","There are 293 ways to make change for a dollar.","The first commercial microwave oven was called the \"1161 Radarange\" and was the size of a refrigerator.","The largest hamburger cooked in the world weighed in at 6,040 pounds.","There are only four words in the English language which end in\"-dous\": tremendous, horrendous, stupendous, and hazardous.","In World War II, the German submarine U-120 was sunk by a malfunctioning toilet.","When the Galileo Probe entered Jupiter's atmosphere, it was traveling at a speed of 106,000 miles per hour. This is the fastest impact speed ever achieved by a man-made object.","The fat that comes from sheep, which is called tallow, can also be used to produce soap and candles.","A one kilogram packet of sugar will have about 5 million grains of sugar.","Obsessive nose picking is referred to as rhinotillexomania.","41 percent of women apply body or hand moisturizer a minimum three times a day.","Crabs have very small hairs on their claws and other parts of their body to help detect water currents and vibrations.","Actress Sally Field was paid $4,000 a week for her role in the TV show The Flying Nun.","In Australia, the average person uses 876 gallons of water daily. In Switzerland they use only 77 gallons of water per person daily.","One-third pound stalk of broccoli contains more vitamin C than 204 apples.","The platypus uses its bill to find animals that it feeds on. Its bill can sense the tiny electric fields that their preys emit.","The kidneys filter over 400 gallons of blood each day.","Every day, the average person swallows about a quart of snot.","St. Patrick never really drove out any snakes from Ireland. This story was an analogy of how he drove paganism out of Ireland.","Americans on the average eat 18 acres of pizza every day.","In the great fire of London in 1666 half of London was burnt down but only 6 people were injured.","In the movie \"The Exorcist\" the vomit that (Regan) Linda Blair hurls at Father Damien Karras is thick pea soup.","Incas used to create pots in the shape of peanuts that were highly prized.","At the White House, president John Adams was said to be the first to display fireworks there.","Alaska got its name from the Aluet word \"Alyeska\" which means \"The Great Land.\"","The only two days of the year in which there are no professional sportsgames (MLB, NBA, NHL, or NFL) are the day before and the day after theMajorLeague All-Star Game.","The revolving door was invented in 1888, by Theophilus Van Kannel.","The words moron, imbecile, and idiot are not interchangable. The one with the highest level of intelligence is a moron, followed, by an imbecile, and then idiot.","The first subway system in America was built in Boston, Massachusetts in 1897.","The first American astronaut in space was Alan B. Shepard Jr.","Research indicates that mosquitoes are attracted to people who have recently eaten bananas.","An average person consumes the equivalent of 26 gallons of milk a year, including almost 28 pounds of cheese.","Orcas (killer whales), when traveling in groups, breathe in unison.","Eating about twenty tart cherries a day could reduce inflammatory pain and headache pain.","The first hair dryer was a vacuum cleaner that was used for drying hair.","Marlboro was the first cigarette company to market a cigarette that had a red filter called \"beauty tip.\" This was done to hide the lipstick marks left on the filter from women smokers.","The reason why milk is white is because it contains a protein called Casein, which is white. Milk also contains fat, which is also white.","A Canadian, Troy Hurtubise, spent $100,000 and almost went bankrupt building a RoboCop style suit so that he could withstand a bear attack.","Great Britain has the highest consumption of ice cream than any other European nation.","It is said that grapefruit got its name because it grows like grapes in clusters. One cluster can have up to 25 grapefruits.","There are approximately one hundred million people in the United States that have a chronic illness.","It would take approximately twenty-four trees that are on average six to eight inches in diameter to produce one ton of newsprint for the Sunday edition of the New York Times.","The range of a medieval long-bow is 220 yards.","Women smile more than men do.","3000 children die every day in Africa because of malaria.","The highest point in Pennsylvania is lower than the lowest point inColorado.","In 1972, a gorilla by the name of \"Koko\" was taught ASL (American Sign Language) for the deaf. By the year 2000, the gorilla could understand approximately 2,000 English words.","Most American women have their first baby when they are 24.3 years old.","The average human scalp has 100,000 hairs.","The itch from a mosquito bite can be soothed by cutting open a clove of garlic and rubbing it on the bite.","The American Automobile association was formed in 1905 for the sole purpose of warning motorists of police speed traps.","About 1 in 5,000 North Atlantic lobsters are born bright blue.","The oldest major soft drink in America is Dr. Pepper, which originated in Waco, Texas in 1885","Consuming chocolate was once considered a sin during the 16th and 17th century. During that time it was provided in the form of a drink and since drinking wine during lent was a sin, so was drinking chocolate.","In 1905, the first pizzeria in the U.S. opened in New York City.","Lake Nicaragua boasts the only fresh-water sharks in the entire world.","In 1916, an elephant was tried and hung for murder in Erwin, Tennessee.","The leading cause of poisoning for children under the age of six in the home is liquid dish soap.","570 gallons of paint would be needed to paint the outside of the White House.","Instead of a Birthday Cake, many Russian children are given a Birthday Pie.","The youngest pope was 11 years old.","Cashew nuts contain oil in the shell that is very irritating to the skin.","It requires 63 feet of wire to make a Slinky toy.","Hershey's Kisses are called that because the machine that makes them looks like it's kissing the conveyor belt.","Singer Michael Jackson owns the rights to the South Carolina State anthem.","Polar bears can smell seals who are 20 miles away.","The triangular shape that Toblerone chocolates are packaged in, is protected by law.","A white tiger can only be born when both parents carry the gene for white colouring.","The name of the Taco Bell dog is Gidget.","The full name of the Titanic ship is R.M.S. Titanic, which stands for Royal Mail Steamship.","If a raisin is dropped into a glass of champagne it will bounce up and down in the glass.","In 1976, fourteen banks merged to form a bank credit card called \"Mastercharge.\" This was later renamed to what is now know as \"Mastercard.\"","Cheetahs are the fastest land animal and can reach speeds up to 72mph.","Since its introduction in February 1935, more than two hundred million Monopoly board games have been sold worldwide.","In the last 30 years, only seven people have been killed by a polar bear in Canada.","Psychokinesis refers to the ability of moving objects through psychic power.","The silkworm moth has lost the ability to fly ever since it has been domesticated.","In 1884, Dr. Hervey D. Thatcher invented the milk bottle.","Frank Wathernam was the last prisoner to leave Alcatraz prison on March 21, 1963","There are six million parts in the Boeing 747-400.","A single chocolate chip gives enough energy to a human being to walk 150 feet.","In the year 1900, for a women to be a telephone operator she had to be between the ages of 17 and 26 and not be married.","All 50 states are listed across the top of the Lincoln Memorial on the back of the $5 bill.","The highest point in Pennsylvania is lower than the lowest point in Colorado.","Minimum wage was 0.25 per hour when it was first enacted in 1938","Water that is safe to drink is referred to as POTABLE","Hair and fingernails are made from the same substance, keratin.","Dalmatian puppies do not have any spots on them when they are born. They actually develop them as they get older.","Sigmund Freud had a morbid fear of ferns.","The largest diamond found in the United States was a 40.23 carat white diamond. It was found in 1924 and nicknamed the \"Uncle Sam.\"","Only 4 percent of babies are born on their actual due date.","Florida has twice as many lightning injuries and deaths than any other state.","Japan has approximately 200 volcanoes and is home to 10 percent of the active volcanoes in the world.","Every three seconds a baby is born somewhere in the world.","By partially filling saucers with vinegar and distributing the saucers around a room, you can eliminate odors.","The plastic things on the end of shoelaces are called aglets.","The first ice hotel was built in Swedish Lapland.","Asthma affects one in fifteen children under the age of eighteen.","The first fruit eaten on the moon was a peach.","Anti-American demonstrators protesting in Bangladesh after the September 11, 2001 terrorist attacks carried posters of Osama bin Laden sitting alongside Bert, a beloved Sesame Street Muppet character.","The airplane Buddy Holly died in was the \"American Pie.\" (Thus the name of the Don McLean song.)","Whale eyes are the size of a grapefruit.","Due to eating habits in the USA, one in three children born in the year 2000 have a chance of getting type II diabetes.","On average, Americans spend 33 percent of their life sleeping.","In New York City, approximately 1,600 people are bitten by other humans annually.","The Danish company Lego, which began in 1932, first manufactured ironing boards, and stepladders.","On average, 42,000 balls are used and 650 matches are played at the annual Wimbledon tennis tournament.","In L.A., U.S.A., a man may legally beat his wife with a leather strap, as long as it is less than 2 inches wide.","Humans and dolphins are the only species that have sex for pleasure.","There is a Hamburger hall of fame in Seymour, Wisconsin.","The first couple to be shown on a sitcom sleeping in the same bed was \"Mary Kay and Johnny.\"","Kiwis are the only known bird to have nostrils located at the tip of their beak.","If you fart consistently for 6 years and 9 months, enough gas is produced to create explosion that is equal to an atomic bomb.","On a Canadian two dollar bill, the flag flying over the Parliament building is an American flag.","Every day 2,700 people die of heart disease.","During the holiday season, approximately $220 million worth of Poinsettias are sold.","Los Angeles is the most polluted city in the USA","There are over three trillion craters on the moon, with some being having a diameter over three feet.","The name for Oz in \"The Wizard of Oz\" was thought up when the creator, Frank Baum, looked at his filing cabinet and saw A-N, and O-Z, hence \"Oz.\"","The fur of the binturong, also known as the \"Asian Bear Cat,\" smells like popcorn. The scent is believed to come from a gland located near the tail.","The average office document gets copied 19 times.","People that use mobile phones are 2.5 time more likely to develop cancer in areas of the brain that are adjacent to the ear they use to talk on the mobile phone.","The pectin that is found in apples aids in lowering cholesterol levels.","The name of the character that is behind bars in the Monopoly board game is Jake the Jailbird.","Ten radishes only contain eight calories.","There are no ants in Iceland, Antarctica and Greenland.","Most snails are hermaphrodites, meaning they have both female and male reproductive organs.","In the 19th century, it was common practice for a Japanese woman to dye their teeth black. They believed that this enhanced sex appeal and maintained healthier teeth.","The male platypus has poisonous spurs on its legs.","The average life span of a mosquito is two weeks.","Antarctica is the only land on our planet that is not owned by any country.","Bananas were discovered by Alexander the Great in 327 B.C. when he conquered India.","An American chews an average of 300 sticks of gum in a year.","There was a time in Japan where a wife being left handed was a ground for divorce.","A meteor has only destroyed one satellite, which was the European Space Agency's Olympus in 1993.","Approximately three jars of peanut butter are sold every second.","There are more than 50 different types of pumpkins. Some of them have names such as Munchkin, Funny Face, and Spooktacular.","By federal law, for a noodle to actually be a noodle it must have 5.5 percent egg solids in it, otherwise it cannot be called a noodle.","Bill Bowerman, the co-founder of the shoe company Nike, got his first shoe idea after staring at a waffle iron. This gave him the idea of using squared spikes to make the shoes lighter.","Approximately 7.5 percent of all office documents get lost.","No word in the English language rhymes with month, orange, silver, and purple.","There are some types of chocolates that are actually good for the arteries and heart.","In 1926, a waiter in Budapest committed suicide. He left his suicide note in the form of a crossword and the police had to get help from the public to solve it.","Badminton originates from a sport in India called \"poona.\"","Texas is the only state that is allowed to fly its flag at the same height as the U.S. flag.","Play-Doh was introduced in 1956 by Hasbro Inc. The only color availabe was an off white, and it came in one size which a one and a half pound can.","1 out of every 4 kids in the USA is overweight.","Each year approximately half of billions dollars is spent on bubble gum by the kids in North America.","A Chinese Scientist discovered that the Earth is round during the Han Dynasty by measuring the sun and moon's path in the sky. He recorded this fact down in the imperial records but went unnoticed until it was unearthed recently but Chinese archaeologists.","Polar bears are left handed.","In a day the blue whale calf drinks approximately 130 gallons of milk.","There are over 100 styles of BluBlocker sunglasses available on the market.","If all the insects in the world were put on a scale, they would out weigh all creatures.","An artist from Chicago named Dwight Kalb created a statue of Madonna made out of 180 pounds of ham.","Research indicates that people prefer the colour blue for their casual clothing.","Scientists with high-speed cameras have discovered that rain drops are not tear shaped but rather look like hamburger buns.","A goldfish has a memory span of three seconds.","In the U.S., the sport that causes the most injuries among the age group of 15-24 is basketball.","Research on pigs led to the development of CAT scans.","George Washington had to borrow money to go to his own inauguration.","In 1962, the first Wal-Mart opened up in Rogers, Arkansas.","The only popcorn museum in the world is lcoated in Marion, Ohio, USA","In 1988, the largest ice cream sundae in history was made. It was made in Edmonton, Alberta, Canada, and weighed in at over 24 tons.","In 1902, the coat hanger was invented Albert Parkhouse who was frustrated at the lack of hooks available to hang up his coat at work. His company thought it was a good idea and patented the invention and unfortunately, Parkhouse never received any money for his idea.","A flea can jump 150 times its size. That is the same as a person able to jump up 1,000 feet in the air.","The Sanskrit word for \"war\" means \"desire for more cows.\"","Some toothpastes contain antifreeze.","Some silkworms can spin cocoons that contain more than two miles of silk.","NASA scientists have concluded that the state of California is moving north and will collide with the state of Alaska in roughly 150 million years.","There are over 9 million beef and dairy cattle in New Zealand.","Women on average live seven years longer than men do.","The tip of a bullwhip moves so fast that it breaks the sound barrier. The crack of the whip is actually a tiny sonic boom.","The iron disulfide (Pyrite) is considered \"fool's gold\" because it looks very similar to gold.","Air is passed through the nose at a speed of 100 miles per hour when a person sneezes.","Cows are able to hear lower and higher frequencies better than human beings.","Another word for hiccups is \"singultus.\"","On average 1,668 gallons of water are used by each person in the United States daily.","The coliseum in Rome was used regularly for about 400 years.","No one in Greece has memorized all 158 verses.","The average human eats 8 spiders in their lifetime at night.","There are some species of snails that are venomous. Their venom can be fatal to humans.","Diamonds were first discovered in the riverbeds of the Golconda region of India over 4,000 years ago.","Construction on the White House began in October of 1792","In 10 minutes, a hurricane releases more energy than all the world'snuclear weapons combined.","The word \"America\" comes from the European explorer \"Amerigo Vespucci.","Bats sleep during the day and feed at night. The place that bats sleep in is called the \"roost.\"","In one day, adult lungs move about 10,000 litres of air.","Finland has 187,888 lakes and 179,584 islands.","Men can read smaller print than women; women can hear better.","The Kodiak, which is native to Alaska, is the largest bear and can measure up to eight feet and weigh as much as 1,700 pounds.","Actress Jamie Lee Curtis invented a special diaper for babies that has a pocket.","Pumpkins contain potassium and vitamin A","Chances of a women getting breast cancer are increased by excesseive use of alcohol.","Before toilet paper was invented, French royalty wiped their bottoms with fine linen.","In China, fish is eaten more than three times what it is in the United States.","Birds do not sweat, as they do not have sweat glands.","Teflon was accidentally discovered by scientist Dr. Roy Plunkett while he was conducting a coolant gas experiment in 1938","Many cancer patients that are treated with chemotherapy lose their hair. For some when the hair grows back, it can grow back a different colour, or be curly or straight.","The actual smallest sovereign entity in the world is the Sovereign Military Order of Malta (S.M.O.M.). It is located in the city of Rome, Italy, has an area of two tennis courts, and as of 2001 has a population of 80, 20 less people than the Vatican. It is a sovereign entity under international law, just as the Vatican is.","Grapes are grown around the world more than any other fruit.","Baseball games between college teams have been played since the Civil War.","The most popular treat for Halloween trick-or-treaters are candy bars with Snickers being the most popular.","It takes the Hubble telescope about 97 minutes to complete an orbit of the Earth. On average, the Hubble uses the equivilent amount of energy as 30 household light bulbs to complete an orbit.","The largest volcano known is on Mars: Olympus Mons, 370 miles wide and 79,000 feet high, is almost three times higher than Mount Everest.","Blood is such a good stain that Native Americans used it for paint.","In 1681, the last dodo bird died.","Racecar driver Lee Petty once left a pitstop and did a full lap at Nascar with a pit crew member still on the hood.","The right lung of a human is larger than the left one. This is because of the space and placement of the heart.","Milk and cheese can aid in the reduction of tooth decay.","Some of the titles that were considered for the hit T.V. show \"Friends\" were Six Of One, Across the Hall, and Insomnia Cafe.","Wherever a person is standing in the state of Michigan in the United States, they are within 85 miles of one of the Great Lakes.","A newly hatched fish is called a \"fry.\"","In 1968, Abbie Hoffman played with a yo-yo while testifying before a congressional committee. He was found in contempt.","French soldiers during World War I had the nickname \"poilu\" which translates to \"hairy one.\"","Initially golf balls were made out of wood. After that they were made out of leather which was stuffed with feathers.","The first toilet ever seen on television was on \"Leave It To Beaver.\"","Archaeologists report that cannabis was most likely the first plant cultivated by humans. Cannabis was used for linen, paper, and garments.","Pearls are rarely found in North American oysters.","Armadillos can be housebroken.","Every U.S. bill regardless of denomination costs just 4 cents to make.","The average Super Bowl party has 18 people.","The record for the longest Monopoly game played in a bathtub is ninety-nine hours.","NASCAR stands for National Association for Stock Car Auto Racing.","The largest type of penguin is the Emperor Penguin which can stand to be almost 3.5 feet tall and weigh more than 90 pounds.","Once a human reaches the age of 35, he/she will start losing approximately 7,000 brain cells a day. The cells will never be replaced.","Pearls melt in vinegar.","The name Jeep came from the abbreviation used in the army for the \"General Purpose\" vehicle, G.P","The Golden Gate Bridge was first opened in 1937","A lifespan of an eyelash is approximately 150 days.","The ruby red slippers in the movie \"The Wizard of Oz\" were sold off at an auction for $660,000","Leaving the water running while brushing your teeth can waste four gallons of water in a minute.","Macadamia nuts are not sold in their shells because it takes 300 pounds per square inch of pressure to break the shell.","The first toilet ever seen on television was on \"Leave It To Beaver\".","The Kool Aid Man used to be known as \"Pitcher Man\" when he was first introduced in 1975","Each year the Pentagon estimates their computer network is hacked about 250,000 times annually.","Many people in parts of China eat insects. Some common insects are bean worms, scoprions, and locusts.","An acre of trees can remove about 13 tons of dust and gases every year from the surrounding environment.","On average, 90 percent of the people that have the disease Lupus are female.","Snake is a delicacy in China.","On average, 100 people choke to death on ballpoint pens every year.","Approximately 40 percent of the U.S. paper currency in circulation was counterfeit by the end of the Civil War.","A squash ball moving at 150 kilometers per hour has the same impact of a .22 bullet.","Actress Debra Winger helped to perform the voice of E.T. in the movie ?E.T. The Extra Terrestrial (1982).\"","Canada beat Denmark 47-0 at the 1949 world hockey championships.","Bats always turn left when exiting a cave.","The total mileage driven by all U-Haul trucks in a year is enough to move a person from the Earth to the moon five times a day for an entire year.","Actor John Ritter was the voice of Clifford, from \"Clifford The Big Red Dog.\"","Doctors in Canada use an adhesive similar to Krazy Glue instead of stitches, lowering the possibility of bacterial infection and minimizing scarring.","Milton Bradley originally wanted to name the game Twister, Pretzel; but he could not since the name was copyrighted.","One bushel of wheat can make enough sandwiches that you could eat three sandwiches a day for over six months.","The width of a tornado can range from less than ten yards to more than a mile.","Every second there are 418 Kit Kat fingers eaten in the world.","Colgate faced a big obstacle marketing toothpaste in Spanish speaking countries. Colgate translates into the command \"go hang yourself.\"","The microwave was invented after a researcher walked by a radar tube and a chocolate bar melted in his pocket.","Dueling is legal in Paraguay as long as both parties are registered blood donors.","The tallest tree recorded is located in Humboldt Redwoods State Park, California. It is a coast redwood and has been measured at 117 metres high.","Although white wine can be produced from both red and white grapes, red wine can only be created from red grapes.","The Ancient Greek women made a type of cheek blush by painting their cheeks with herbal pastes which was made out of crushed berries and seeds.","A crocodile cannot stick its tongue out.","To make an espresso 42 coffee beans are needed.","If you have three quarters, four dimes, and four pennies, you have$1.19.  You also have the largest amount of money in coins without being able to make change for a dollar.","Pigs have no sweat glands, which is why they stay in water or mud to keep cool.","There are 500,000 detectable earthquakes in the world each year.","Used in art the word \"sfumato\" refers to the subtle blending of an outline by gradually blending one tone into another.","Researchers have developed odourless socks. The sock fabric is made by attaching molecules that contain chlorine called halamines to textile fibers.","Levan, which is located in Utah, got its name from \"navel\" which is levan spelt backwards. It was named this because it is in the center of Utah.","The word, tattoo originated from the Tahitain word \"tattau\" which means \"to mark.\"","France, Switzerland, United Kingdom, Greece, and Australia have always been in the modern Olympics since it began in 1896","Penguins can jump as high as 6 feet in the air.","In Cleveland, Ohio, it's illegal to catch mice without a hunting license.","The Lemon shark grows about 24,000 new teeth a year. A new set of teeth grow approximately every 14 days.","Chinese Crested dogs can get acne.","Whale oil was used in some car transmissions until 1973","The Barn Owls hearing is so highly developed that they can hunt for their prey in total darkness.","The average American drinks 400 glasses of milk in a year.","The three most valuable brand names on earth: Marlboro, Coca Cola, and Budweiser, in that order.","A sneeze can travel as fast as one hundred miles per hour.","There is a large brass statue of Winnie-the-Pooh in Lima, Peru.","In a year, the average Americans eats approximately 18 pounds of Turkey.","The most overdue book in the world was borrowed from Sidney Sussex College in Cambridge, England and was returned 288 years later.","Edwin Armstrong invented FM radio in 1933. The first men to use FM radio to communicate with Earth from the moon's surface were named Edwin Aldrin and Neil Armstrong.","A little under one quarter of the people in the world are vegetarians.","British scientists have found evidence that heart attacks increase significantly for people who watch soccer penalty shoot-outs.","The Apollo 17 crew were the last men on the moon.","Elephants can't jump. Every other mammal can.","The cigarette lighter was invented before the match.","In the UK, one third of accidental deaths that happen occur in the home.","Sharks are so powerful that their bite can generate a force of up to 18 tons per square inch.","1 out of 350,000 Americans get electrocuted in their life.","The ant can lift 50 times its own weight, can pull 30 times its own weight, and always falls over on its right side when intoxicated.","Apple seeds are poisonous as they contain a cyanide compound.","Krispy Kreme make five million doughnut a day.","Five Jell-O flavors that flopped: celery, coffee, cola, apple, and chocolate.","Dentists have recommended that a toothbrush be kept at least 6 feet away from a toilet to avoid airborne particles resulting from the flush.","The only woman that has appeared on a U.S. paper currency is Martha Washington.","Bile produced by the liver is responsible for making your feces a brownish, green colour.","Some Ribbon worm will eat themselves if they cannot find food. This type of worm can still survive after eating up to 95 percent of its body weight.","In Russia, when flowers are given for a romantic occasions, flowers are given in odds numbers as even number of flowers is given at funerals only.","BluBlocker sunglasses were developed with lenses that were used in the NASA space program for American astronauts.","The cross bow was invented by the Chinese and records of its usage goes back to as far as the Three Kingdom Period (220 a.d.-280 a.d.).","State with the highest percentage of people who walk to work: Alaska.","Slaves under the last emperors of China wore pigtails so they could be picked out quickly.","The cost to build the Empire State Building was $40,948,900","Cotton crops can be sprayed up to 40 times a year making it the most chemical-intensive crop in the world.","An adult \"Gold Frog\" measures to be 9.8 millimeters in body length.","Ironically, when doctors in Los Angeles, California went on strike in 1976, the daily number of deaths in the city dropped 18 percent.","The greatest snowfall ever in a single storm was 189 inches at the Mount Shasta Ski Bowl in February, 1959.","The most expensive shoes in the world are ruby slippers located in Harrods in London, which cost $1.6 million, has a full time security guard. The shoes are made from platinum thread and has 642 rubies in them. It took over 700 hours to produce the shoe.","David McConnell started the California Perfume Company (CPC) in 1886. Today the company is known as Avon, which he named after his favorite playwright William Shakespeare, and Stratford on Avon.","Stannous fluoride, which is the cavity fighter found in toothpaste is made from recycled tin.","The word \"sophomore\" means \"sophisticated moron.\"","Bats emit ultrasonic sounds to communicate with each other.","Heavier lemons contain more and tastier juice.","Uranus has 27 moons.","Baskin Robbins plain vanilla ice cream is the number one selling flavour and accounts for a quarter of their sales.","The first product that the toy company Mattel came out with was picture frames.","The theme song of the Harlem Globetrotters is \"Sweet Georgia Brown.\"","One out of four American households own a cat.","An elephant in the wild can eat anywhere from 100 - 1000 pounds of vegetation in a 16 hour period.","From 1939 to 1942, there was a undersea post office in the Bahamas.","There are more recreational golfers per capita in Canada than any other country in the world.","In Belgium, 172,000 tons of chocolate are produced in a year.","The elephant is the national animal of Thailand.","In 1845, inventor Thomas Adams started the world's first chewing gum factory.","There are more than 640 muscles in the human body.","There are mirrors on the moon. Astronauts left them so that laser beams could be bounced off of them from Earth. These beams help give us the distance to the moon give or take a few metres.","Oral-B is a combination of oral hygiene and the letter B, which stands for the word better.","A dragonfly has a lifespan of for to seven weeks.","In the year 2000, there were approximately 11,000 injuries that were treated in a hospital in the U.S. that resulted from fireworks.","In 1963, Mister Rogers was ordained as a Presbyterian minister.","On average, a hen lays 300 eggs per year.","Pebbles cereal was actually named after the shape of the cereal and not the Pebbles Flintstone character.","Coca-Cola used to contain cocaine when it was initially introduced.","The highest recorded speed of a sneeze is 165 km per hour.","Honey is used sometimes for antifreeze mixtures and in the center of golf balls.","Shridhar Chillal from India is known to have the record for the longest fingernails in the world, which were each at least three feet long.","The only commercial aircraft that is able to break the sound barrier is the Concorde.","The three wealthiest families in the world have more assets than the combined wealth of the forty-eight poorest nations.","The parents of Albert Einstein were worried that he was mentally slow because it took him a long time to learn how to speak.","Watermelons are a popular gift to bring to a host in China or Japan.","Japanese research has concluded that moderate drinking can boost IQ levels.","The human heart creates enough pressure when it pumps out to the body to squirt blood 30 feet.","The average cow produces about 2,305 gallons of milk each year.","Airports that are at higher altitudes require a longer airstrip due to lower air density.","The game Monopoly was once very popular in Cuba; however, Fidel Castro ordered that all games be destroyed.","The story of Mulan had been told in China for almost 1,500 years before Disney decided to make it into an animated movie.","It would take 29 million years for a car travelling 100 miles per hour to reach the nearest star.","It is estimated that over fifty-four million people died in World War II, which was the bloodiest war in history.","The state that grows the most cranberries is Wisconsin. More than 300 million pounds of cranberries are grown in Wisconsin.","On average, 150 couples get married in Las Vegas each day.","In the USA, 32 percent of employees eat lunch and work at the same time.","The Nobel prize was first awarded in 1901","The meaning of Siberia is \"sleeping land.\"","The king of hearts is the only king without a mustache.","In an average lifetime, a person will spend 4 years travelling in an automobile and six months waiting at a red light.","A chance of a woman having twins is increased after the age of 35. About 1 in 27 women will give birth to twins after this age. After 50 the chances of having twins is 1 in 9","People drank gold powder mixed in with water in medieval Europe to relieve pain from sore limbs.","Over 200 varieties of watermelons are grown in the U.S","James Bond is also known as Mr. Kiss-Kiss-Bang-Bang.","The Lion King is the top grossing Disney movie of all-time with domestic gross intake of $312 million.","The 1912 Olympics was the last Olympics that gave out gold medals that were made entirely out of gold.","Sharks are capable of going at least 6 weeks without eating; the record observed in an aquarium is 15 months by a species of shark known as the swell sharks)","The reason firehouses have circular stairways is from the days when the engines were pulled by horses. The horses were stabled on the ground floor and figured out how to walk up straight staircases.","The colours yellow, red, and orange are used in fast food restaurants because those are the colours that stimulate hunger.","The chewing gum Juicy Fruit has 10 calories. This is approximately the same as a bite of whole wheat bread.","The most popular brand of raisins is Sunmaid.","Many years ago, a fish was caught that was 33 inches long and seemed to be heavier than it should. When they cut the fish, fishermen found a full of bottle of ale inside it.","In 1903 Mary Anderson invented the windshield wipers.","Every continent begins and ends in the same letter. eg Africa, Europe.","Apples, not caffeine, are more efficient at waking you up in the morning.","The word Thailand means \"land of the free.\"","People over the age of fifty will start to lose their dislike for foods that taste bitter.","\"Dreamt\" is the only English word that ends in the letters \"mt.\"","Pepper was sold as individual grains during the Elizabethan times. The guards at the London docks had to sew up their pockets so they would not steal any of the pepper.","In Belgium, 94 percent of children under the age of fourteen own LEGO products.","A person who is a specialist in wine making is called an oenologist.","Every day, over five billion gallons of water are flushed down toilets in the United States.","The song \"Happy Birthday\" brings in about $2 million in licensing revenue to Warner Communications who hold the copyright to the song.","Americans eat approximately 20 pounds of pasta per person each year.","Even though a polar bears fur looks white it is actually colourless and is made with hollow tubes. The reason the bear looks white is because the rough inner surface of the tubes make light scatter and reflect at many different angles which gives the white appearance.","The total number of steps in the Eiffel Tower are 1665","The Mexican version of the Tooth Fairy is known as the Tooth Mouse, which takes the tooth and leaves treasures in its place.","The Dead Sea has been sinking for last several years.","By walking an extra 20 minutes every day, an average person will burn off seven pounds of body fat in an year.","Crayola is a French word that means \"Oily chalk.\"","Cows drink anywhere from 25-50 gallons of water each day.","Nine egg yolks have been found in one chicken egg.","The average bank teller loses about $250 every year.","The United States has paved enough roads to circle the Earth over 150 times.","When the divorce rate goes up in the United States, toy makers report that the sale of toys also rise.","Ivory bar soap floating was a mistake. They had been mixing the soap formula causing excess air bubbles that made it float. Customers wrote and told how much they loved that it floated, and it has floated ever since.","More than $1 billion is spent each year on neck ties in the United States.","Ticks can be as small as a grain of rice and grow to be as big as a marble.","Every year, more than one million miles of Twizzlers licorice is made.","The only 15 letter word that can be spelled without repeating a letter is uncopyrightable.","In a year, about 90 million jars of Skippy Peanut Butter are sold. This works out to three jars sold every second.","Thirty percent of all bingo players are under the age of 35","Medical research has found substances in mistletoe that can slow down tumor growth.","The only king without a moustache in a deck of cards is the king of hearts.","Monopoly is the best-selling board game in the world.","Alexandre Gustave Eiffel, the man who designed the Eiffel Tower, also designed the inner structure of the Statue of Liberty in New York Harbour.","The earliest known example of an organized market for equities dates from Rome, second century B.C","Our eyes are always the same size from birth, but our nose and ears. never stop growing.","In Kentucky, 50 percent of the people who get married for the first time are teenagers.","Thomas Edison designed a helicopter that would work with gunpowder. It ended up blowing up and also blew up his factory.","Approximately one out of four injuries by athletes involve the wrist and hand.","Fido means faithful in Latin.","A caterpillar grows roughly 27,000 times its size when it first emerges as an egg.","When snakes are born with two heads, they fight each other for food.","When blue whales are first born, they gain as much as 200 pounds a day while they are calves.","Dill seeds are so small that approximately 10,000 dill seeds would be required to make an ounce.","There is enough water in American swimming pools to cover the whole city of San Francisco seven feet deep.","The fastest running bird is the Ostrich, which has been clocked at 97.5 kilometres per hour.","On average, 350 squirts are needed from milking a cow to make a gallon of milk.","Nerve cells can travel as fast as 120 metres per second.","The mythical Scottish town of Brigadoon appears for one day every one hundred years.","Uranus? winter and summer seasons last the equivalent of 21 Earth years.","Toronto was the first city in the world with a computerized traffic signal system.","The longest game of Monopoly played underwater is 45 days.","The first person to die in the electric chair was William Kemmler, an ax murderer from New York on August 6, 1890","The candlefish is so oily that it was once burned for fuel.","A study concludes that kids who snore do poorly in school.","More people die from eating sharks then from being eaten by them. This is due to a poison in shark meat.","The length of a human esophagus is 25 centimeters.","On average a business document is copied 19 times.","There are five years in a quinquennium.","In a lifetime, an average driver will release approximately 912 pints of wind inside a car.","During his lifetime, artist Vincent Van Gogh only sold one of his paintings (The Red Vineyard)","Annually Americans eat 45 million turkeys at Thanksgiving.","The longest punt return for a touchdown was 103 yards.","Herbert Hoover, who was the 31st president of the United Stated, turned over all the Federal salary checks he received to charity during the 47 years he was in government.","The country of Fiji is made up of 332 islands.","Mardi Gras means \"Fat Tuesday.\" This is the festival that New Orleans, Louisiana is famous for having every year.","The number of births that occur in India each year is higher than the entire population of Australia.","The risk of cardiovascular disease is twice as high in women that snore regularly compared to women who do not snore.  updated.","Rabbits can live up to ten years.","The largest ketchup bottle in the world is a 170 feet tall and is located in Collinsville, Illinois, USA. It was built in 1949 by the W.E. Caldwell Company as a water tower.","The state of Alaska has almost twice as many caribou as people.","The Taj Mahal was actually built for use as a tomb.","In the United States, approximately 135 million cars travel every day on the streets, roads, and interstates.","The 20th president of the United States James Garfield could write Greek with one hand and Latin with the other at the same time.","The reason why hair turns gray as we age is because the pigment cells in the hair follicle start to die, which is responsible for producing \"melanin\" which gives the hair colour.","Adolf Hitler wanted to be an architect, but he failed the entrance exam at the architectural school in Vienna.","False Bay, on the southern tip of Africa and close to Cape Town, South Africa, is a breeding ground for great white sharks, which feed off the thousands of seals in the bay. However, it is the only area in the known world in which these sharks are known to breach - they attack the seals by coming up vertically, often leaping clear of the water with their prey in their mouths.","\"Pomology\" is the science of growing an apple.","The Taj Mahal, located in Agra, India, was actually built for use as a tomb by Mogul ruler Shah Jehan for his wife, Arjuman Banu Begum.","When Coca-Cola was invented, American tourists that visited Spain were surprised to see that Coke was three times as expensive as a glass of brandy.","Nylon is a man-made fibre that is made from coal and petroleum.","The \"Mexican Hat Dance\" is the official dance of Mexico.","Before 1928, yo-yos used to be called bandalores in the United States.","The difference between horns and antlers is that horns never stop growing and antlers shed and grow every year.","A human head remains conscious for about 15 to 20 seconds after it is been decapitated.","A fetus develops fingerprints at eighteen weeks.","Twelve men have landed on and explored the moon.","Someone gets divorced every ten to thirteen seconds.","Fat is important for the development of children and normal growth.","May babies are on average 200 grams heavier than babies born in other months.","The largest wedding chapel in Las Vegas is the Viva Las Vegas Chapel, which can seat 100 people.","Most toilets flush in E flat.","An oyster can change its gender.","The WD in WD-40 stands for Water Displacer.","One billion pounds of pasta would need approximately 2,021,452,000 gallons of water to cook it. This is equivalent to 75,000 Olympic-size swimming pools.","A fall of 30 feet can be survived my most cats.","The most common injury caused by cosmetics is to the eye by a mascara wand.","One billion seconds is about 32 years.","Odontophobia is the fear of teeth.","To make one glass of orange juice, 50 glasses of water are needed to grow enough oranges to make the juice.","In 1960 there were 16,067 gambling slots in Nevada. By 1999, this number rose to 205,726 slots which would be one slot for every 10 people residing there.","In the U.S., over one million gallons of cosmetics, drinks, and lotions are sold that contain aloe in them per year.","The average person is about a quarter of an inch taller at night.","Some arthritis medications contain gold salts, which is used as an anti-inflammatory.","A common name for pincurls is also spitcurls because woman sometimes wet their hair with their saliva before curling it.","Historically, a blue ribbon has been awarded for first prize.","In 1970, Chip maker Intel purchased a pear orchard to build their corporate headquarters on.","The puma and the leopard are the highest jumping mammals. They are able to reach a height of 16.5 feet.","Dieting can cause bad breath since less saliva is produced which leads to dry mouth.","French astronomer Adrien Auzout had once considered building a telescope that was 1,000 feet long in the 1600s. He thought the magnification would be so great, he would see animals on the moon.","Thirty-five percent of the people who use personal ads for dating arealready married.","A duck's quack doesn't echo, and no one knows why.","Donkeys can live between 30 to 50 years in captivity.","Sharks have survived on earth for about 400 million years.","In 1992, when EuroDisney first opened in France, the public beat some of the park characters because at the time most people had been against the park being built.","Children who are breast fed tend to have an IQ seven points higher than children who are not.","In Ireland, a prime minister is a called a Taoiseach.","The Great Pyramids used to be as white as snow because they were encased in a bright limestone that has worn off over the years.","It only takes a male horse 14 seconds to copulate.","The first translation of the Bible into English was in 1382 A.D., by John Wycliff.","The palms of your hands and the soles of your feet cannot tan, or grow hair.","The largest number of children born to one woman, who was a Russian peasant is 69","Roman emperors ate flamingo tongues which were considered a delicacy. Also parrotfish livers, and pheasant brains were feasted on.","The same amount of calories are burned by doing 6 sessions that are 5 minutes each of an activity and doing 1 session of that activity for 30 minutes.","In 1893, the first mosque in the United States was built.","On August 21st, 1911, someone stole the Mona Lisa, the most famous painting in the world, from the Louvre Museum. It was recovered two years later.","Almonds are members of the peach family.","Bhutan issued a stamp in 1973 that looked like a record and actually would play the Bhutanese national anthem if placed on a record player.","The water displacement product, WD-40, can be found in 80 percent of American homes.","On average it takes a shark seven days to replace a tooth.","The fastest flying butterfly is the Monarch, which has been clocked with a speed as high as 17 miles per hour.","A group of crows is called a murder.","Fried spiders taste like nuts.","In the U.S., over 35 million people have used some sort of illegal drug in the last year.","Depending on the size, it can take an oyster anywhere from few months to many years to form a pearl.","Bobby Carpenter was the first American player to score 50 goals in a season.","Thomas Edison was afraid of the dark.","When explorers first arrived in Venezuela, they were reminded of Venice. They named the country \"Little Venice\", which translated into Spanish is Venezuela.","In a day, an elephant can drink 80 gallons of water.","The founder of JC Penny had the middle name of Cash.","An orca whale can hold its breath for up to 15 minutes.","It is not possible to tickle yourself. The cerebellum, a part of the brain, warns the rest of the brain that you are about to tickle yourself. Since your brain knows this, it ignores the resulting sensation.","There are no blossoms on the branches of a fig tree, instead it is inside the fruit.","Dairy cows can produce 20 to 35 gallons of saliva a day.","Actor Sylvester Stallone once had a job as a lion cage cleaner.","The country of Bolivia is named after a fighter Simon Bolivar.","On average, the life span of an American dollar bill is eighteen months.","Over 4.5 billion sticks have Trident gum have been chewed. If the stick of gum were laid out end to end they could circle the globe approximately 1.8 times.","The word racecar and kayak are the same whether they are read left to right or right to left.","The capital of Vermont, Montpelier is the only state capital in the United States that does not have a McDonalds.","The waste produced by one chicken in its lifetime can supply enough electricity to run a 100-watt bulb for five hours.","You can only smell 1/20th as well as a dog.","The venom of the king cobra is so deadly that one bite can kill twenty people or one elephant.","The five Olympic rings represent the five continents linked together in friendship.","Atlantic salmon can jump as high as 4.5 meters out of the water.","A U.S. company came out with a toilet night-light that sends out a green warning beacon when the seat is up.","Every three seconds, a new baby is born.","Surveys indicate that the number one reason people play BINGO is for leisure.","The YKK that you see on zippers stands for Yoshida Kogyo Kabushiki Kaisha which is the name of the founder of the zipper manufacturing company in Japan.","The town with the most stop signs per capita than any other in the US: LaConner, Washington.","Talc was used by cavemen 15,000 years ago as an ingredient added to make paint.","A starfish can turn its stomach inside out.","In North America there are approximately 618 roller coasters.","The reason why some people get a cowlick is because the growth of their hair is in a spiral pattern, which causes the hair to either stand straight up, or goes to a certain angle.","The capital of Burkina Faso is Ouagadougou.","Peaches were once known as Persian apples.","Male rabbits are called \"bucks,\" females are \"does.\"","The formula for Coca-cola has never been patented.","In the United States, poisoning is the fourth leading cause of death among children.","Heinz first started making ketchup in 1876 and the recipe has remained the same ever since.","When telephone companies first began hiring telephone operators, they chose teenage boys for the job. They switched to women because the teenage boys were wrestling instead of working and pulling pranks on callers.","The hormone replacement drug \"Premarin\" is made from the urine of pregnant horses.","Chocolate accounts for less than two percent of the fat in the American diet.","The longer white infants from low-income families are breast-fed, the less likely they will be overweight as young children, researchers said on Monday.","Close to 80 percent of people who watch the Super Bowl on television, only do so to view the commercials.","In 1631, two London bible printers accidentally left the word \"not\" out of the seventh commandment, which then read, \"Thou shalt commit adultery.\" This legendary book is now known as the \"Wicked Bible.\"","The New York Yankees have appeared in the World Series a league leading 38 times and won 26 titles.","One Neptune year lasts 165 Earth years.","The most common pear world-wide is the Bartlett. It is bell-shaped, sweet and soft with a light green colour.","Paper money is not made from wood pulp but from cotton. This means that it will not disintegrate as fast if it is put in the laundry.","On average, he ratio of yellow kernels to white kernals in a bag of popcorn is 9:1"]